Working with Series

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [30]:
series_data = Series([1,2,3,4,5])

In [31]:
series_data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [32]:
#prints the values 
series_data.values

array([1, 2, 3, 4, 5], dtype=int64)

In [33]:
#prints the index values
series_data.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
marks = Series([98,95,93,75], index =['Maths','science','chemistry','hindi'])

In [35]:
# prints both the index and marks
marks

Maths        98
science      95
chemistry    93
hindi        75
dtype: int64

In [36]:
marks.index

Index([u'Maths', u'science', u'chemistry', u'hindi'], dtype='object')

In [37]:
marks > 80

Maths         True
science       True
chemistry     True
hindi        False
dtype: bool

In [38]:
marks[marks >80]

Maths        98
science      95
chemistry    93
dtype: int64

In [39]:
'science' in marks

True

In [40]:
marks_dict = marks.to_dict()

In [41]:
marks_dict

{'Maths': 98, 'chemistry': 93, 'hindi': 75, 'science': 95}

In [42]:
marks = Series(marks_dict)

In [43]:
marks

Maths        98
chemistry    93
hindi        75
science      95
dtype: int64

In [44]:
 subjects = ['Maths','chemistry','hindi','science','social']

In [45]:
marks = Series(marks_dict,index=subjects)

In [46]:
marks

Maths        98.0
chemistry    93.0
hindi        75.0
science      95.0
social        NaN
dtype: float64

In [47]:
pd.isnull(marks)

Maths        False
chemistry    False
hindi        False
science      False
social        True
dtype: bool

In [20]:
pd.notnull(marks)

Maths         True
chemistry     True
hindi         True
science       True
social       False
dtype: bool

In [21]:
marks

Maths        98.0
chemistry    93.0
hindi        75.0
science      95.0
social        NaN
dtype: float64

Working with Series Done
Working with DataFrames

In [84]:
import webbrowser
websites = 'https://en.wikipedia.org/wiki/NFL_win%E2%80%93loss_records'
webbrowser.open(websites)

True

In [49]:
nfl_records = pd.read_clipboard()

In [50]:
nfl_records

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division
0,1,Dallas,Cowboys,493,367,6,0.573,1960.000,866,NFC,East,NaN
1,2,Green,Bay,Packers,730,553,37.000,0.567,1921,"1,320",NFC,North
2,3,Chicago,Bears,744,568,42,0.565,1920.000,"1,354",NFC,North,NaN
3,4,Miami,Dolphins,439,341,4,0.563,1966.000,784,AFC,East,NaN
4,5,New,England,Patriots,476,383,9.000,0.554,1960,868,AFC,East
5,6,New,York,Giants,684,572,33.000,0.543,1925,"1,289",NFC,East

In [51]:
nfl_records.columns

Index([u'Rank', u'Team', u'Won', u'Lost', u'Tied', u'Pct.', u'First', u'NFL',
       u'Season', u'Total', u'Games', u'Division'],
      dtype='object')

In [52]:
nfl_records.Team
#nfl_records.Team or nfl_records[Team]

0     Dallas
1      Green
2    Chicago
3      Miami
4        New
5        New
Name: Team, dtype: object

In [53]:
DataFrame(nfl_records,columns=['Team','First NFL Season','Total Games'])

      Team  First NFL Season  Total Games
0   Dallas               NaN          NaN
1    Green               NaN          NaN
2  Chicago               NaN          NaN
3    Miami               NaN          NaN
4      New               NaN          NaN
5      New               NaN          NaN

In [54]:
#returns the number of records provided or 5 records a s default
nfl_records.head(3)

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division
0,1,Dallas,Cowboys,493,367,6,0.573,1960.000,866,NFC,East,NaN
1,2,Green,Bay,Packers,730,553,37.000,0.567,1921,"1,320",NFC,North
2,3,Chicago,Bears,744,568,42,0.565,1920.000,"1,354",NFC,North,NaN

In [55]:
# to retreive row data 
nfl_records.ix[3]

Rank               4
Team           Miami
Won         Dolphins
Lost             439
Tied             341
Pct.               4
First          0.563
NFL             1966
Season           784
Total            AFC
Games           East
Division         NaN
Name: 3, dtype: object

In [56]:
nfl_records['Stadium'] = "Levi's Stadium"

In [57]:
nfl_records

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Stadium
0,1,Dallas,Cowboys,493,367,6,0.573,1960.000,866,NFC,East,NaN,Levi's Stadium
1,2,Green,Bay,Packers,730,553,37.000,0.567,1921,"1,320",NFC,North,Levi's Stadium
2,3,Chicago,Bears,744,568,42,0.565,1920.000,"1,354",NFC,North,NaN,Levi's Stadium
3,4,Miami,Dolphins,439,341,4,0.563,1966.000,784,AFC,East,NaN,Levi's Stadium
4,5,New,England,Patriots,476,383,9.000,0.554,1960,868,AFC,East,Levi's Stadium
5,6,New,York,Giants,684,572,33.000,0.543,1925,"1,289",NFC,East,Levi's Stadium

In [58]:
stadiums = Series(['Levis','At&t'], index = [4,0])

In [59]:
stadiums

4    Levis
0     At&t
dtype: object

In [60]:
nfl_records['Stadium'] = stadiums

In [61]:
nfl_records

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Stadium
0,1,Dallas,Cowboys,493,367,6,0.573,1960.000,866,NFC,East,NaN,At&t
1,2,Green,Bay,Packers,730,553,37.000,0.567,1921,"1,320",NFC,North,NaN
2,3,Chicago,Bears,744,568,42,0.565,1920.000,"1,354",NFC,North,NaN,NaN
3,4,Miami,Dolphins,439,341,4,0.563,1966.000,784,AFC,East,NaN,NaN
4,5,New,England,Patriots,476,383,9.000,0.554,1960,868,AFC,East,Levis
5,6,New,York,Giants,684,572,33.000,0.543,1925,"1,289",NFC,East,NaN

In [62]:
nfl_records

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division,Stadium
0,1,Dallas,Cowboys,493,367,6,0.573,1960.000,866,NFC,East,NaN,At&t
1,2,Green,Bay,Packers,730,553,37.000,0.567,1921,"1,320",NFC,North,NaN
2,3,Chicago,Bears,744,568,42,0.565,1920.000,"1,354",NFC,North,NaN,NaN
3,4,Miami,Dolphins,439,341,4,0.563,1966.000,784,AFC,East,NaN,NaN
4,5,New,England,Patriots,476,383,9.000,0.554,1960,868,AFC,East,Levis
5,6,New,York,Giants,684,572,33.000,0.543,1925,"1,289",NFC,East,NaN

In [63]:
#Creating a dataframe from dictionary
data = {'City':['sf','la','ch'],'Population':[1234,2345,3456]}

In [64]:
city_population  = DataFrame(data)

In [65]:
#Dataframe created 
city_population

  City  Population
0   sf        1234
1   la        2345
2   ch        3456

In [66]:
my_series = Series([1,2,3,4], index = ['A','B','C','D'])
my_series

A    1
B    2
C    3
D    4
dtype: int64

In [67]:
my_index = my_series.index
my_index

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [68]:
my_index[2:]

Index([u'C', u'D'], dtype='object')

In [28]:
# we cannot change the indexs if tried arises a error
my_index[0] = 'S'

TypeError: Index does not support mutable operations

In [75]:
changed_my_series = my_series.reindex(['A','B','C','D','E','F'])

In [77]:
changed_my_series

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [79]:
#changed the index and filled the new value 
changed_my_series.reindex(['A','B','C','D','E','F','G'], fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [80]:
ranger = range(15)

In [81]:
ranger

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [82]:
new_index = Series(['USA','Mexico','Canada'], index = [0,5,10])

In [83]:
new_index.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [3]:
from numpy.random import randn
dframe = DataFrame(randn(25).reshape(5,5), index = ['A','B','D','E','F'], columns = ['col1','col2','col3','col4','col5'])
dframe

       col1      col2      col3      col4      col5
A -0.404170 -0.487770  0.268650  0.749200 -1.136999
B  0.385918 -0.775313 -2.084729  0.155129  1.109481
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111
E -0.908220 -0.239208 -2.164979  0.610165  0.209201
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458

In [4]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])
dframe2

       col1      col2      col3      col4      col5
A -0.404170 -0.487770  0.268650  0.749200 -1.136999
B  0.385918 -0.775313 -2.084729  0.155129  1.109481
C       NaN       NaN       NaN       NaN       NaN
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111
E -0.908220 -0.239208 -2.164979  0.610165  0.209201
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458

In [6]:
new_col = ['col1','col2','col3','col4','col5','col6']
dframe2.reindex(columns = new_col)

       col1      col2      col3      col4      col5  col6
A -0.404170 -0.487770  0.268650  0.749200 -1.136999   NaN
B  0.385918 -0.775313 -2.084729  0.155129  1.109481   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111   NaN
E -0.908220 -0.239208 -2.164979  0.610165  0.209201   NaN
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458   NaN

In [7]:
dframe

       col1      col2      col3      col4      col5
A -0.404170 -0.487770  0.268650  0.749200 -1.136999
B  0.385918 -0.775313 -2.084729  0.155129  1.109481
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111
E -0.908220 -0.239208 -2.164979  0.610165  0.209201
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458

In [9]:
dframe.ix[['A','B','C','D','E','F'], new_col]

       col1      col2      col3      col4      col5  col6
A -0.404170 -0.487770  0.268650  0.749200 -1.136999   NaN
B  0.385918 -0.775313 -2.084729  0.155129  1.109481   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111   NaN
E -0.908220 -0.239208 -2.164979  0.610165  0.209201   NaN
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458   NaN

In [10]:
dframe

       col1      col2      col3      col4      col5
A -0.404170 -0.487770  0.268650  0.749200 -1.136999
B  0.385918 -0.775313 -2.084729  0.155129  1.109481
D -1.140113  0.577433 -0.557718 -1.198897 -0.827111
E -0.908220 -0.239208 -2.164979  0.610165  0.209201
F -0.734569 -1.532317 -0.277865  1.771561 -0.601458

In [4]:
data  = Series(['one','two',np.nan,'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [8]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [10]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [12]:
clean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [13]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [15]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,4,5],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  4.0  5.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [18]:
dframe2.dropna(thresh = 2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  4.0  5.0
2  NaN  7.0  NaN  9.0

In [20]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  4.0  5.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [24]:
dframe2.fillna({0:0,1:2,2:1,3:3}, inplace=True)

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  2.0  4.0  5.0
2  0.0  7.0  1.0  9.0
3  1.0  2.0  1.0  3.0

In [26]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  2.0  4.0  5.0
2  0.0  7.0  1.0  9.0
3  1.0  2.0  1.0  3.0